Портал_EDT/src/InformationRegisters/Аук_ИтогиЗавершенияЭтапов/Аук_ИтогиЗавершенияЭтапов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аук_ИтогиЗавершенияЭтапов</name>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеРезультатаРасчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаСтавки</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аукцион</name>
    <type>
      <types>CatalogRef.Аук_Аукционы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Аук_УчастникиАукционов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтрокаДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Портал_EDT/src/InformationRegisters/Аук_ИтогиЗавершенияЭтапов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ДобавитьЗапись(пСтруктураЗаписи) Экспорт	
	сткРез = Аук_ОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "Аук_ИтогиЗавершенияЭтапов");
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;	
	КонецЕсли;
КонецФункции

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат Аук_ОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "Аук_ИтогиЗавершенияЭтапов");
	
КонецФункции	

Функция ИтоговоеЗначениеЛидирующейСтавки(пСткОтбор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ИтогиЗавершенияЭтапов.ПредставлениеРезультатаРасчета КАК ПредставлениеРезультатаРасчета
	|ИЗ
	|	РегистрСведений.Аук_ИтогиЗавершенияЭтапов КАК Аук_ИтогиЗавершенияЭтапов
	|ГДЕ
	|	Аук_ИтогиЗавершенияЭтапов.Аукцион = &Аукцион
	|	И Аук_ИтогиЗавершенияЭтапов.НомерЭтапа = &НомерЭтапа";
	
	Запрос.УстановитьПараметр("Аукцион",	пСткОтбор.Аукцион);
	Запрос.УстановитьПараметр("НомерЭтапа", пСткОтбор.НомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";	
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Возврат Выборка.ПредставлениеРезультатаРасчета;	
	КонецЕсли;	
КонецФункции

#КонецОбласти
